import 'en_US.dart';

const Map<String, String> ua_UA = {
  flag: "🇺🇦",
  error: "Помилка",
  login: "Логін",
  password: "Пароль",
  next: "Далі",
  authorization: "Авторизація",
  emptyEmailPassword: "Введіть email та пароль",
  email: "Email",
  badEmail: "Некоректний email.",
  userNotFound: "Користувач не знайден.",
  signUp: "Реєстрація",
  confirmPassword: "Підтвердить пароль",
  name: "Ім'я",
  emptyName: "Введіть ім'я",
  badPassword:
      "Пароль повинен містити більше ніж 8 символів, повинен мати хоча б одну велику літеру, одну маленьку літеру, одну цифру.",
  confPassNotEqualPass: "Паролі не співпадають",
  countrySearch: 'Пошук по назві країни',
  userDisabled: "Вас заблоковано.",
  emailInUse: "Цей email вже використовуэться.",
  operarionNotAllowed: "Ця операція заборонена для вас.",
  unknownError: "Сталася помилка.",
  wrongPassword: "Не вірний пароль",
  addRest: "Додай свій ресторан до нашої системи.",
  joinUs:
      "Приєднайся до нашої платформи, де ти можеш резервувати столи у ресторанах.",
  unknown: "Невідомо",
  unauthorized: "Не авторизовано",
  badFile: "Файл пошкоджено",
};
